const config = {
  BASE_URL: 'http://bl.7yue.pro/v1',
  APP_KEY: '5jT7meqiX8jbD3OH',
  NEXT: 'next', // 当前期刊 下一期 的 url
  PRE: 'previous', // 当前期刊 上一期 的 url
  STORAGE_KEY: {
    PERIODICAL_ID: 'periodicalID-' // 缓存的 期刊的 key
  }
}
// 错误码(error_code) 由前端来定义 错误时 给用户 显示什么, java 每次改东西都得搞半天, 慢啊
const errorCode = {
  0: 'OK, 成功',
  1: '抱歉, 出现了一个错误', // 默认错误提示
  // 100x 通用类型:
  1000: '输入参数错误',
  1001: '输入的json格式不正确',
  1002: '找不到资源',
  1003: '未知错误',
  1004: '禁止访问',
  1005: '不正确的开发者 key',
  1006: '服务器内部错误',
  // 200x 点赞类型
  2000: '你已经点过赞了',
  2001: '你还没点过赞',
  // 300x 期刊类型
  3000: '该期内容不存在',
  // HTTP 状态码
  200: '',
  201: '创建成功',
  202: '更新成功',
  204: '删除成功',
  301: '永久重定向',
  400: '请求包含不支持的参数',
  401: '未授权',
  403: '被禁止访问',
  404: '请求的资源不存在',
  413: '上传的 File 体积太大',
  500: '服务器内部错误'
}
// HTTP 状态码
/* const succMessage = {
  200: '',
  201: '创建成功',
  202: '更新成功',
  204: '删除成功',
  301: '永久重定向',
  400: '请求包含不支持的参数',
  401: '未授权',
  403: '被禁止访问',
  404: '请求的资源不存在',
  413: '上传的 File 体积太大',
  500: '服务器内部错误'
} */
export {
  config,
  errorCode/* ,
  succMessage */
}
